Revit 2027 API
RenderingSettings.LightingSource Property
 The lighting scheme type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightingSource LightingSource { get; set; }
Public Property LightingSource As LightingSource
	Get
	Set
public:
property LightingSource LightingSource {
	LightingSource get ();
	void set (LightingSource value);
}
member LightingSource : LightingSource with get, set
Property Value
LightingSource
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace